//Банкомат містить в достатній кількості купюри номіналом 10, 20, 50, 100, 200 і 500 гривень. Знайти найменшу кількість купюр, якою можна видати суму в n гривень, або вивести -1, якщо вказану суму видати не можна.
//Єдиною умовою є зчитування даних з файлу і запис даних в файл
#include <iostream>
#include <fstream>
#include <string>
using namespace std;
int Money(int n) {//функція, в якій знаходимо кількість купюр
	int k = 0;//змінна за допомогою якої будемо знаходити залишок від ділення нашої суми
	int count1 = 0, count2 = 0, count3 = 0, count4 = 0, count5 = 0, count6 = 0, count = 0;//
	count1 = n / 500;//знаходимо кількість купюр по 500
	k = n % 500;//знаходимо залишок від ділення на 500
	count2 = k / 200;//знаходимо кількість купюр по 200
	k = k % 200;//знаходимо залишок від ділення на 200
	count3 = k / 100;//знаходимо кількість купюр по 100
	k = k % 100;//знаходимо залишок від ділення на 100
	count4 = k / 50;//знаходимо кількість купюр по 50
	k = k % 50;//знаходимо залишок від ділення на 50
	count5 = k / 20;//знаходимо кількість купюр по 20
	k = k % 20;//знаходимо залишок від ділення на 20
	count6 = k / 10;//знаходимо кількість купюр по 10
	k = k % 10;//знаходимо залишок від ділення на 10
	if (k != 0) count = -1;//за даної умови - сума не кратна 10 видаватися не буде- так як найменшою є номінал 10грн, тому виводимо -1
	else {
		count = count1 + count2 + count3 + count4 + count5 + count6;//знаходимо значення кількості купюр, яке рівне сумі кількості купюр від різних номіналів
	}
	return count;//повертаємо значення кількості купюр
}
int main() {
	cout << "Enter any amount of money" << endl;
	ifstream file;//використовуємо для зчитування даних з файлу
	string Path = "C:/Users/Яна/Desktop/circle.txt ";//шлях до файлу - можна вибрати або однакові файли або різні
	file.open(Path);//відкриваємо файл за вказаним шляхом
	int n = 0;//певна сума коштів, введена користувачем
	file >> n;//зчитування даних з файлу
	if (n < 1 or n>1000000) cout << "Wrong number!!!Try again" << endl;//дана сума має бути більшою за 1 та меншою за 1000000
	else { cout << n << endl; }//
	file.close();//закриваємо файл	
	ofstream fileOut;//використовуємо для запису даних у файлу
	string path = "C:/Users/Яна/Desktop/money.txt ";//шлях до файлу
	fileOut.open(path);//відкриваємо файл за вказаним шляхом
	if (!fileOut.is_open()) cout << "Didn't open" << endl;//якщо файл не видкривається- виводимо повідомлення про це
	else {
		cout << "File is open" << endl;//якщо файл  видкривається- виводимо повідомлення про це
		fileOut << "You can get- " << Money(n) << " banknotes" << endl;//вводимо значення функції у файл
	}
	fileOut.close();//закриваємо файл
}